Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE/tmx_teil_2.tmx
Source language: de
Languages: en

source: Bratspieße [Teile von Kochgeräten]
en: Spits [parts of cooking apparatus]

source: Temperaturregelventile [Teile von Zentralheizungskörpern]
en: Temperature control valves [parts of central heating radiators]

source: Temperaturempfindliche Schalter [Thermostatventile] für Zentralheizungskörper
en: Temperature sensitive switches [thermostatic valves] for central heating radiators

source: Anlagen zur Erwärmung von Getränken
en: Installations for heating beverages

source: Geräte zum Erhitzen von Nahrung
en: Installations for heating foodstuffs

source: Anlagen zum Befeuchten
en: Installations for humidifying

source: Automatische Bewässerungsanlagen für Geflügel
en: Automatic watering installations for poultry

source: Aufsatzbrausen für Badezimmerwasserhähne
en: Push-on sprays for use with bathroom faucets

source: Chemische Sterilisationsgeräte [Geräte zur Wasseraufbereitung]
en: Chemical sterilization units [water treatment equipment]

source: Ultraviolettsterilisationsgeräte [Geräte zur Wasseraufbereitung]
en: Ultraviolet sterilization units [water treatment equipment]

source: Heizgeräte zur Verwendung in der Wohnung
en: Heating apparatus for use in the home

source: Heizgeräte zur Verwendung bei der Behandlung von Abfallstoffen
en: Heating apparatus for use in the treatment of waste material

source: Elektrische Innenbeleuchtungsanlagen
en: Electric indoor lighting installations

source: Elektrische Leuchten für festliche Dekorationen
en: Electric lights for festive decorations

source: Automatische Wasserverteilungsapparate
en: Appliances for water distribution [automatic]

source: Apparate für Heißluftbäder
en: Hot air bath fittings

source: Beleuchtung für Notenständer
en: Lights for music stands

source: Dekorative Beleuchtung für Christbäume
en: Decorative lighting for christmas trees

source: Außenbeleuchtung
en: Outdoor lighting

source: Ventilatoren
en: Ventilating fans

source: Filtergeräte für Wasserversorgungsanlagen
en: Filter apparatus for water supply installations

source: Filterkästen für die Wasserreinigung
en: Filter boxes for water purification

source: Filter zur Luftreinigung
en: Filters for cleaning air

source: Zapfanlagen für gekühlte Getränke [ausgenommen Verkaufsautomaten]
en: Refrigerated beverage dispensing units [other than vending]

source: Kühlschränke zur Aufbewahrung von Getränken
en: Refrigerated cabinets for the storage of drink

source: Kühlschränke zur Aufbewahrung von Lebensmitteln
en: Refrigerated cabinets for the storage of food

source: Brotröster für den Haushalt [elektrisch]
en: Domestic bread toasters [electric]

source: Heizgeräte für den Haushalt
en: Domestic heating utensils

source: Toiletten mit Sterilisierungsfunktionen
en: Toilets with sterilizing functions

source: Glasscheiben [Teile von Öfen]
en: Glass plates[parts of stoves]

source: Ventile als Teile von Sprinkleranlagen
en: Valves being parts of sprinkler systems

source: Elektrische Reiskocher
en: Electric rice cookers

source: Luftbefeuchter [Wasserbehälter für Zentralheizungskörper]
en: Air humidifiers [water containers for central heating radiators]

source: Luftinduktorgeräte [Klimatisierung]
en: Air inductor apparatus [air conditioning]

source: Füllvorrichtungen für Öfen
en: Loading apparatus for furnaces

source: Absperrhähne als Sicherheitsapparate für Gasgeräte
en: Stop cocks being safety apparatus for gas apparatus

source: Absperrhähne als Sicherheitsapparate für Wassergeräte
en: Stop cocks being safety apparatus for water apparatus

source: Absperrventile als Sicherheitsapparate für Gasgeräte
en: Stop valves being safety apparatus for gas apparatus

source: Elektrische Fritteusen
en: Deep fryers, electric

source: Elektrische Eierkocher
en: Electric egg cookers

source: Brenner für Heizungsanlagen
en: Burners for heating installations

source: Keramikbriketts zur Verwendung in Barbecue-Grills [nicht brennbar]
en: Ceramic briquettes for use in barbecue grills [non-flammable]

source: Lampen für elektrische Anlagen
en: Lamps for electrical installations

source: Sprinklergeräte [automatisch] zur Verwendung auf Golfplätzen
en: Sprinkler apparatus [automatic] for use on golf courses

source: Wärmetauscher, ausgenommen Maschinenteile
en: Heat exchangers, other than parts of machines

source: Sockel für nicht elektrische Lampen
en: Bases for non-electric lamps

source: Badarmaturen zur Wasserregelung
en: Bath armatures for water control

source: Öfen zur Abfallentsorgung
en: Waste disposal furnaces

source: Geräte zur Regelung des Gasdurchflusses
en: Installations for controlling the flow of gases

source: Anlagen zum Kühlen von Trinkwasser
en: Installations for cooling drinking water

source: Absaugsäulen [ausgenommen Laboreinrichtungen]
en: Extraction columns [other than laboratory apparatus]

source: Sicherheitsventile für Wassergeräte
en: Safety valves for water apparatus

source: Automatische Temperaturregler für Zentralheizungskörper
en: Automatic temperature regulators for central heating radiators

source: Gärverzögerungsschränke für Teig
en: Retarding cabinets for dough

source: Automatische Kaffeezubereitungsanlagen
en: Automatic installations for making coffee

source: Beleuchtungskörper für Haushaltszwecke
en: Lighting fixtures for household use

source: Beleuchtung für Teiche
en: Lighting for ponds

source: Öfen mit Kammerhaube
en: Chambered lid furnace

source: Lampen für Fahrtrichtungsanzeiger für Fahrräder
en: Direction indicators for cycles (Lamps for -)

source: Bunsenbrenner für Laborzwecke
en: Bunsen burners for laboratory use

source: Küchenherde mit Emailleoberflächen
en: Cookers having vitreous enamelled surfaces

source: Präsentationsvitrinen mit Kühlvorrichtung
en: Refrigerated merchandise display cases

source: Versandbehälter mit Kühlvorrichtung
en: Refrigerated shipping containers

source: Duschtüren mit Metallrahmen
en: Shower doors with a metal frame

source: Elektrische Händetrockner
en: Electric hand dryers

source: Wasseraufbereitungsgeräte zur Wasserenthärtung für Haushaltszwecke
en: Water treatment apparatus for water softening for domestic use

source: Glühfäden für elektrische Lampen
en: Filaments for electric lamps

source: Filter [Teile von häuslichen oder gewerblichen Anlagen]
en: Filters [parts of household or industrial installations]

source: Absperrventile für die Gasregulierung
en: Stop valves for regulating gas

source: Urinale als Teile von sanitären Anlagen
en: Urinals being parts of sanitary installations

source: Vakuumöfen für die Behandlung von Linsen
en: Vacuum ovens for the treatment of lenses

source: Filter für die Abgasreinigung
en: Filters for waste gas purification

source: Kaminlüfter zur Rauchgasabsaugung
en: Fire ventilators for exhausting vapours

source: Elektrische Zentralheizungskesselsysteme
en: Electric central heating boiler systems

source: Elektrische Wäschetrockner [Wärmetrocknung]
en: Electric clothes dryers [heat drying]

source: Vakuum-Solarwärmerohrkollektoren [Wärmetauscher]
en: Evacuated heat pipe solar collectors [heat exchangers]

source: Abzugsschächte für Heizungsgeräte
en: Flues for heating apparatus

source: Elektrische Kühlschränke [für Haushaltszwecke]
en: Electric refrigerators [for household purposes]

source: Speisewassererhitzer [für industrielle Zwecke]
en: Feed water heaters [for industrial purposes]

source: Glasabdeckungen als Bestandteile von Bräunungslampen
en: Glass covers being fittings for lamps for sun lamps

source: Apparate zur Regelung der Wasserzufuhr
en: Apparatus for controlling water supply

source: Steuergeräte [Thermostatventile] für Heizungsanlagen
en: Control devices [thermostatic valves] for heating installations

source: Toilettendeckel [Teile von sanitären Anlagen]
en: Seat lids [parts of sanitary installations]

source: Selbstregulierende Heizgeräte in Form von flexiblen Bändern
en: Self regulating heaters in the form of flexible straps

source: Dämpfungsapparate [Teile von Öfen]
en: Damping apparatus [parts of furnaces]

source: Lampenschirme für Tischlampen
en: Table lamp (Lampshades for -)

source: Elektrisch gesteuerte Wasserhähne
en: Electrically controlled water faucets

source: Elektrisch betriebene Kolbenheizgeräte zur Verwendung in Labors
en: Electrically energized flask heaters for use in laboratories

source: Elektrisch beheizte Bratspieße
en: Electrically heated roasting skewers

source: Beheizte Schränke für Nahrungsmittel
en: Heated cabinets for foodstuffs

source: Hauben für Lüftungsgeräte
en: Hoods for ventilating apparatus

source: Armaturen für sanitäre Zwecke
en: Fittings for sanitary purposes

source: Armaturen für den Wasserabfluss
en: Fittings for the draining of water

source: Heizplatten [für Haushaltszwecke]
en: Hot plates [for household purposes]

source: Industrielle Geschirrtrockenmaschinen
en: Industrial dishdrying machines

source: Elektrische Kühlschränke
en: Electric refrigerators

source: Elektrische Heizkissen, ausgenommen für medizinische Zwecke
en: Electric warming pads, other than for medical use

source: Elektrische Feueranzünder
en: Electric firelighters

source: Piezoanzünder [ausgenommen für Raucher]
en: Piezo lighters [other than for smokers]

source: Geräte zum Warmhalten von Heißgetränken
en: Apparatus for keeping hot drinks warm

source: Thermoelektrische Geräte zum Erhitzen von Nahrungsmitteln
en: Thermoelectric apparatus for heating foodstuffs

source: Fonduegeräte [Kochgeräte]
en: Fondues [cooking apparatus]

source: Öfen für Zentralheizungsanlagen
en: Furnaces for central heating

source: Hähne zur Steuerung des Wasserdurchflusses
en: Taps for the control of water flow

source: Teekessel [elektrisch]
en: Tea kettles [electric]

source: Abwasserbehandlungsanlagen [Reinigung]
en: Sewage treatment [purification] installations

source: Elektrisch beheizte Handtuchstangen
en: Electrically heated towel rails

source: Dekorative elektrische Beleuchtungsapparate
en: Decorative electric lighting apparatus

source: Lüftungsgitter als Teile von Sauglüftern
en: Ventilation grilles being parts of extractor fans

source: Verbrennungsanlagen für fossile Brennstoffe
en: Combustion installations for fossil fuels

source: Fest montierte Unterwasserbeleuchtungsanlagen für Schwimmbecken
en: Fixed underwater lighting installations for swimming pools

source: Taschenlampen mit wiederaufladbaren elektrischen Vorrichtungen
en: Flashlights utilising electric rechargeable devices

source: Klimageräte für Datenverarbeitungsräume
en: Air conditioning for data processing rooms

source: Elektrische Flaschenwärmer
en: Electric bottle heaters

source: Gaskessel [ausgenommen Maschinenteile]
en: Gas boilers [other than parts of machines]

source: Regelungs- und Sicherheitszubehör für Gasleitungen
en: Regulating and safety accessories for gas pipes

source: Regelungs- und Sicherheitszubehör für Wassergeräte
en: Regulating and safety accessories for water apparatus

source: Ventile als Temperaturregelungsapparate für Zentralheizungskörper
en: Apparatus for controlling temperature in central heating radiators [valves]

source: Elektrische Autoklaven für Sterilisierungszwecke
en: Electrical autoclaves for use in sterilization

source: Elektrische Heizelemente
en: Electrical heating elements

source: Badewannen mit seitlichem Einstieg für Körperbehinderte
en: Side-entry baths for use by the physically handicapped

source: Elektrische Heizlüfter
en: Electric heating fans

source: Wärmetauscher zur Temperaturregelung von Getränken aus Spendern
en: Heat exchangers for the temperature control of drinks being dispensed

source: Sprüharmaturen [Teile von sanitären Anlagen]
en: Spray fittings [parts of sanitary installations]

source: Temperaturbegrenzer für Zentralheizungskörper [Thermostatventile] mit Expansionstäben
en: Temperature limiters for central heating radiators [thermostatic valves] incorporating expansion rods

source: Anlagen zum Beheizen von Schwimmbecken
en: Installations for heating swimming pools

source: Automatische Bewässerungsanlagen für Pflanzen
en: Automatic watering installations for plants

source: Mischventile [Wasserhähne]
en: Mixing valves [faucets]

source: Rohrschlangen als Teile von Kühlanlagen
en: Coils being parts of cooling installations

source: Heizkörperventile [thermostatisch]
en: Radiator valves [thermostatic]

source: Abflussrohre [Sanitärarmaturen]
en: Spouts [plumbing fittings]

source: Zerstäuber für Duschen [Sanitärarmaturen]
en: Shower sprayers [plumbing fittings]

source: Tragbare elektrische Heizgeräte
en: Portable electric heaters

source: Klimaanlagen für gewerbliche Zwecke
en: Air conditioning apparatus for commercial use

source: Sterilisiergeräte für Babyfläschchen
en: Sterilisers for babies' feeding bottles

source: Sterilisiergeräte für Dentalinstrumente
en: Sterilisers for dental instruments

source: Elektrische Popcornmaschinen
en: Electric popcorn making machines

source: Batteriebetriebene Notbeleuchtungsgeräte mit Leuchtstoffröhren
en: Battery powered fluorescent emergency lighting units

source: Dekorative Tischspringbrunnen
en: Decorative table-top water fountains

source: Warmwasserbereiter für Duschbäder
en: Water heaters for shower baths

source: Elektrische Waffeleisen
en: Waffle irons, electric

source: Infrarottrockenapparate fÃ¼r das Haar
en: Infrared drying apparatus for the hair

source: Elektrische Außenbeleuchtungskörper
en: Outdoor electrical lighting fixtures

source: Filterelemente für Lüftungsöffnungen von Wasserversorgungstanks
en: Filter elements for the air vents of water supply tanks

source: Dampfkochtöpfe für den Haushalt [elektrisch]
en: Domestic autoclave pressure cookers [electric]

source: Babyflaschenwärmer für den Haushalt [elektrisch]
en: Domestic baby bottle warmers [electric]

source: Transportable Geräte zur Abwasserbehandlung
en: Transportable instruments for processing sewage

source: Handtrockner mit einem warmen Luftstrom
en: Dryers for the hands using a warm air drying stream

source: Wasserionisatoren [für Haushaltszwecke]
en: Water ionizers [for household purposes]

source: Luftinduktorgeräte [Lüftung]
en: Air inductor apparatus [ventilation]

source: Luftreinigungsgeräte zur Verwendung mit Wasserverteilungsanlagen
en: Air purgers for use with water distribution installations

source: Gasbeheizte Kessel zur Erzeugung von Warmwasser im Haushalt
en: Gas fired boilers for producing domestic hot water

source: Absperrhähne für die Gasregelung
en: Stop cocks for regulating gas

source: Aufkohlungsöfen [für gewerbliche Zwecke]
en: Carbonizing furnaces [for industrial purposes]

source: Gasbrenner
en: Gas burners

source: Elektrische Espressomaschinen
en: Electric espresso machines

source: Elektrische Öfen
en: Electric furnaces

source: Sprinkler [automatisch] zur Oberflächenmontage
en: Sprinklers [automatic] for surface installation

source: Sprinkler [automatisch] zur unterirdischen Montage
en: Sprinklers [automatic] for underground installation

source: Spültische [ausgenommen Möbel]
en: Sink units [other than furniture]

source: Trockenapparate und -anlagen
en: Drying apparatus and installations

source: Ionenbürsten zur Aufbereitung der Luft
en: Ionising brushes for the treatment of air

source: Isothermische Schränke
en: Isothermic cabinets

source: Mechanismen zur Regelung des Flüssigkeitsstands in Tanks [Ventile]
en: Mechanisms for controlling fluid level in tanks [valves]

source: Wasserreinigungsgeräte und -maschinen
en: Water purifying apparatus and machines

source: Filtriergeräte für Aquarien
en: Aquarium filtration apparatus

source: Geräte zur Wasserentsalzung mittels Umkehrosmose
en: Water desalinating apparatus utilizing reverse osmosis

source: Taumeltrockner [Wärmetrockner]
en: Tumble dryers [heat dryers]

source: Anlagen für chemische Aufbereitung
en: Chemical processing equipment

source: Kühltruhen für Ladengeschäfte
en: Sales counters [refrigerated]

source: Regelarmaturen für Wasserleitungen
en: Regulatory fittings for water pipes

source: Geräte zum Räuchern von Lebensmitteln
en: Appliances for smoking foodstuffs

source: Automatische Spülungen für Urinale
en: Automatic flushing installations for urinals

source: Automatische Bewässerungsanlagen für Schweine
en: Automatic watering installations for pigs

source: Chemische Anlagen zur Trinkwasseraufbereitung
en: Chemical installations for conditioning drinking water

source: Desinfektionsmittelspender für Waschräume
en: Disinfectant dispensers for washrooms

source: Ventile als Teile von Heizungen
en: Valves as part of radiators

source: Wandhähne [Sanitärarmaturen]
en: Bibcocks [plumbing fittings]

source: Vormontierte Multifunktionsbrausen
en: Pre-assembled multifunction showers

source: Kühlapparate für Getränke mit Ausgabefunktion
en: Refrigerated dispensing units for beverages

source: Bogenlampen [Beleuchtungskörper]
en: Arc lamps [lighting fixtures]

source: Lichtfilter [ausgenommen für medizinische oder photographische Zwecke]
en: Light filters [other than for medical or photographic use]

source: Leuchtröhren für Insektenvertilgungsapparate
en: Light tubes being parts of insect killing apparatus

source: Siebe zur Verwendung mit Duschwannen
en: Strainers for use with shower trays

source: Sonnenbänke für kosmetische Zwecke
en: Ultra-violet sunbeds for cosmetic purposes

source: Schränke zur Reinigung von Bettpfannen [Teile von Wasserversorgungsinstallationen]
en: Cabinets for washing bedpans [parts of water supply installations]

source: Filter zur Verwendung an Geräten für die Dampferzeugung
en: Filters for use with apparatus for steam generating

source: Filter für Wasserreinigungsgeräte
en: Filters for water purifiers

source: Sanitärablaufarmaturen für Bidets
en: Sanitary drain armatures for bidets

source: Elektrische Lichterketten
en: Electric fairy lights

source: Beleuchtungsgeräte mit Leuchtdioden [LEDs]
en: Light-emitting diodes [LED] lighting apparatus

source: Apparate für Hydromassagebäder
en: Hydromassage bath apparatus

source: Durchlauföfen zum Härten von Klebstoffen
en: Continuous furnaces for tempering adhesives

source: Absaugsysteme für Schneidetische
en: Cutting table extraction installations

source: Zylinder zur Erhitzung von Wasser
en: Cylinders for the heating of water

source: Angepasste Halterungen zur Verwendung mit Solarheizröhren
en: Supports adapted for use with solar heating tubes

source: Lüftungsgeräte für Fahrzeuge
en: Ventilating apparatus for vehicles

source: Freistehende Dekontaminierungsduschen
en: Freestanding decontamination showers

source: Heizvitrinen für die Speisenversorgungsbranche
en: Heated cabinets for use in the food service industry

source: Beheizte Handtuchtrockenstangen
en: Heated towel drying rails

source: Heizgeräte für gasförmige Brennstoffe
en: Heating apparatus for gaseous fuels

source: Heizgeräte für flüssige Brennstoffe
en: Heating apparatus for liquid fuels

source: Druckentlastungsgeräte für Warmwasserbereiter
en: Pressure relief apparatus for use with water heaters

source: Druckbegrenzungsventile [Sicherheitsapparate] für Wassergeräte
en: Pressure relief valves [safety apparatus] for water apparatus

source: Drucküberwachungsapparate [Sicherheitszubehör für Wassergeräte]
en: Pressure supervision apparatus [safety apparatus for water apparatus]

source: Wasserberegnungsgeräte [automatisch]
en: Water sprinkling devices [automatic]

source: Spülungsgriffe [Teile von sanitären Anlagen]
en: Flusher handles [parts of sanitary installations]

source: Lampenschirme für Lichtquellen
en: Shades for light sources

source: Stroboskoplichter [Lichteffekte]
en: Strobe lights [light effects]

source: Stroboskoplampen [dekorativ]
en: Stroboscopic lamps [decorative]

source: Zubehör für Wandlampen [ausgenommen Schalter]
en: Wall lights (fittings for -) [other than switches]
